from ChapterClass import ChapterClass


class ChapterThreeClass(ChapterClass):

    def __init__(self):
        dictionary = {'Японское: 1': 'ひとつ',
                      'Японское: 2': 'ふたつ',
                      'Японское: 3': 'みっつ',
                      'Японское: 4': 'よっつ',
                      'Японское: 5': 'いつつ',
                      'Японское: 6': 'むっつ',
                      'Японское: 7': 'ななつ',
                      'Японское: 8': 'やっつ',
                      'Японское: 9': 'ここのつ',
                      'Японское: 10': 'とお',
                      '時': 'じ', 'час': 'じ',
                      '分': 'ふん', 'минута': 'ふん',
                      '午後': 'ごご', 'после полудня': 'ごご',
                      '午前': 'ごぜん', 'до полудня': 'ごぜん',
                      '半': 'はん', 'половина': 'はん',
                      '20 лет': 'はたち'}
        super().__init__(dictionary)
