from ChapterClass import ChapterClass


class ChapterTwoClass(ChapterClass):

    def __init__(self):
        dictionary = {'доброе утро': 'おはようございます', 'добрый день': 'こんにちは',
                      'добрый вечер': 'こんばんは', 'до встречи': 'では、また',
                      '病院': 'びょういん', 'больница': 'びょういん',
                      '電気': 'でんき', 'электричество': 'でんき',
                      'кто? (разг.)': 'だれ', 'кто? (вежл.)': 'どなた',
                      '本': 'ほん', 'книга': 'ほん',
                      '辞書': 'じしょ', 'словарь': 'じしょ',
                      '雑誌': 'ざっし', 'журнал': 'ざっし',
                      '新聞': 'しんぶん', 'газета': 'しんぶん',
                      '手帳': 'てちょう', 'записная книжка': 'てちょう',
                      '名刺': 'めいし', 'визитка': 'めいし',
                      '鉛筆': 'えんぴつ', 'карандаш': 'えんぴつ',
                      'ключи': 'かぎ',
                      '時計': 'とけい', 'часы': 'とけい',
                      '傘': 'かさ', 'зонт': 'かさ',
                      'портфель, сумка': 'かばん',
                      '自動車': 'じどうしゃ', 'автомобиль': 'じどうしゃ',
                      '机': 'つくえ', 'стол': 'つくえ',
                      'стул': 'いす',
                      '英語': 'えいご', 'английский язык': 'えいご',
                      '日本語': 'にほんご', 'японский язык': 'にほんご',
                      '～語': 'ご', '~ язык': 'ご',
                      '何': 'なに', 'что': 'なに',
                      'так': 'そう'}
        super().__init__(dictionary)
